-- MySQL dump 10.13  Distrib 5.6.40, for Linux (x86_64)
--
-- Host: localhost    Database: parkingsystem
-- ------------------------------------------------------
-- Server version	5.6.40

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `ps_admin`
--

DROP TABLE IF EXISTS `ps_admin`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `ps_admin` (
  `admin_id` int(10) NOT NULL AUTO_INCREMENT,
  `admin_username` varchar(50) NOT NULL,
  `admin_password` varchar(50) NOT NULL,
  PRIMARY KEY (`admin_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ps_admin`
--

LOCK TABLES `ps_admin` WRITE;
/*!40000 ALTER TABLE `ps_admin` DISABLE KEYS */;
INSERT INTO `ps_admin` VALUES (1,'08070315108','123456'),(2,'08070315110','123456'),(3,'username','123456');
/*!40000 ALTER TABLE `ps_admin` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `ps_button`
--

DROP TABLE IF EXISTS `ps_button`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `ps_button` (
  `bt_pid` int(10) NOT NULL,
  `bt_state` int(10) NOT NULL,
  PRIMARY KEY (`bt_pid`) USING BTREE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ps_button`
--

LOCK TABLES `ps_button` WRITE;
/*!40000 ALTER TABLE `ps_button` DISABLE KEYS */;
INSERT INTO `ps_button` VALUES (0,0),(1,0);
/*!40000 ALTER TABLE `ps_button` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `ps_parking_log`
--

DROP TABLE IF EXISTS `ps_parking_log`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `ps_parking_log` (
  `pl_id` int(10) NOT NULL AUTO_INCREMENT,
  `user_name` varchar(100) NOT NULL,
  `pl_start_time` varchar(100) DEFAULT NULL,
  `pl_end_time` varchar(100) DEFAULT NULL,
  `pl_money` double(100,2) DEFAULT NULL,
  PRIMARY KEY (`pl_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=126 DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ps_parking_log`
--

LOCK TABLES `ps_parking_log` WRITE;
/*!40000 ALTER TABLE `ps_parking_log` DISABLE KEYS */;
INSERT INTO `ps_parking_log` VALUES (1,'username','2018-07-25 10:28:01','2018-07-25 15:25:15',-100.50),(2,'刘一','2018-07-25 10:31:37','2018-07-25 20:30:40',-100.10),(3,'陈二','2018-07-25 10:28:01','2018-07-25 10:32:45',-30.50),(5,'刘一','2018-07-25 10:28:01','2018-07-25 15:25:15',-100.50),(6,'刘一','2018-07-25 10:31:37','2018-07-25 20:30:40',-100.10),(7,'陈二','2018-07-25 10:28:01','2018-07-25 10:32:45',-30.50),(8,'刘一','2018-07-25 10:28:01','2018-07-25 15:25:15',-100.50),(9,'刘一','2018-07-25 10:31:37','2018-07-25 20:30:40',-100.10),(10,'陈二','2018-07-25 10:28:01','2018-07-25 10:32:45',-30.50),(11,'刘一','2018-07-25 10:28:01','2018-07-25 15:25:15',-100.50),(12,'刘一','2018-07-25 10:31:37','2018-07-25 20:30:40',-100.10),(13,'陈二','2018-07-25 10:28:01','2018-07-25 10:32:45',-30.50),(14,'刘一','2018-07-25 10:28:01','2018-07-25 15:25:15',-100.50),(15,'刘一','2018-07-25 10:31:37','2018-07-25 20:30:40',-100.10),(16,'陈二','2018-07-25 10:28:01','2018-07-25 10:32:45',-30.50),(17,'刘一','2018-07-25 10:28:01','2018-07-25 15:25:15',-100.50),(18,'刘一','2018-07-25 10:31:37','2018-07-25 20:30:40',-100.10),(19,'陈二','2018-07-25 10:28:01','2018-07-25 10:32:45',-30.50),(20,'刘一','2018-07-25 10:28:01','2018-07-25 15:25:15',-100.50),(21,'刘一','2018-07-25 10:31:37','2018-07-25 20:30:40',-100.10),(22,'陈二','2018-07-25 10:28:01','2018-07-25 10:32:45',-30.50),(23,'刘一','2018-07-25 10:28:01','2018-07-25 15:25:15',-100.50),(24,'刘一','2018-07-25 10:31:37','2018-07-25 20:30:40',-100.10),(25,'陈二','2018-07-25 10:28:01','2018-07-25 10:32:45',-30.50),(26,'张三','2018-07-26 10:28:01','2018-07-25 10:28:01',-200.00),(37,'刘一','2018-08-02 20:46:03','2018-08-02 20:47:39',-2.00),(41,'刘一','2018-08-02 21:36:48','2018-08-02 21:37:10',-20.00),(43,'刘一','2018-08-02 21:40:38','2018-08-02 21:41:00',-20.00),(45,'刘一','2018-08-02 21:46:50','2018-08-02 21:46:56',-20.00),(46,'刘一','2018-08-02 22:00:48','2018-08-02 22:01:17',-2.00),(47,'刘一','2018-08-02 22:03:14','2018-08-02 22:03:40',-2.00),(48,'刘一','2018-08-02 22:07:52','2018-08-02 22:08:14',-2.00),(49,'刘一','2018-08-03 08:45:12','2018-08-03 08:46:08',-2.00),(56,'刘一','2018-08-03 20:28:34','2018-08-03 20:28:39',-2.00),(57,'刘一','2018-08-03 20:38:10','2018-08-03 20:38:15',-2.00),(59,'刘一','2018-08-03 20:47:41','2018-08-03 20:47:57',-2.00),(60,'刘一','2018-08-03 20:49:10','2018-08-03 20:49:35',-2.00),(61,'刘一','2018-08-03 20:50:55','2018-08-03 20:51:33',-2.00),(62,'刘一','2018-08-03 20:58:15','2018-08-03 20:58:24',-2.00),(63,'刘一','2018-08-03 21:01:31','2018-08-03 21:02:21',-2.00),(64,'刘一','2018-08-04 23:55:35','2018-08-04 23:55:42',-2.00),(65,'刘一','2018-08-04 23:55:48','2018-08-04 23:55:56',-2.00),(67,'刘一','2018-08-04 23:56:50','2018-08-04 23:57:14',-2.00),(69,'刘一','2018-08-05 00:28:42','2018-08-05 00:28:46',-2.00),(70,'tom','2018-08-05 09:48:01','2018-08-05 09:48:32',-2.00),(74,'tom','2018-08-05 11:52:50','2018-08-05 11:53:24',-2.00),(75,'tom','2018-08-05 11:53:54','2018-08-05 11:54:04',-2.00),(76,'刘一','2018-08-05 15:24:21','2018-08-05 15:27:40',-2.00),(77,'刘一','2018-08-05 15:30:49','2018-08-05 15:31:59',-2.00),(78,'tom','2018-08-06 22:39:56','2018-08-06 22:40:02',-2.00),(79,'tom','2018-08-06 22:40:57','2018-08-06 22:41:04',-2.00),(80,'张三','2018-08-07 09:21:33','2018-08-07 09:21:38',-2.00),(81,'王五','2018-08-07 09:26:14','2018-08-07 09:26:19',-2.00),(82,'刘一','2018-08-07 12:06:56','2018-08-07 12:07:00',-2.00),(83,'gr','2018-08-07 12:33:22','2018-08-07 12:33:32',-2.00),(84,'张三','2018-08-07 14:55:26','2018-08-07 14:55:38',-2.00),(85,'张三','2018-08-07 16:37:12','2018-08-07 16:37:45',-2.00),(86,'刘一','2018-08-10 22:32:38','2018-08-10 22:32:42',-2.00),(87,'root','2018-08-13 15:11:57','2018-08-13 15:12:55',-2.00),(88,'刘一','2018-08-13 18:53:24',NULL,NULL),(89,'刘一','2018-08-13 21:04:09','2018-08-13 21:04:11',-2.00),(90,'刘一','2018-08-13 21:04:42','2018-08-13 21:04:44',-2.00),(91,'刘一','2018-08-13 21:05:09','2018-08-13 21:05:11',-2.00),(92,'刘一','2018-08-14 08:48:49','2018-08-14 08:48:51',-2.00),(93,'刘一','2018-08-14 10:23:11','2018-08-14 10:23:16',-2.00),(94,'刘一','2018-08-14 10:23:21','2018-08-14 10:23:24',-2.00),(95,'刘一','2018-08-14 10:23:31','2018-08-14 10:23:58',-2.00),(96,'刘一','2018-08-14 10:24:16','2018-08-14 10:24:20',-2.00),(97,'刘一','2018-08-14 10:28:35','2018-08-14 10:28:40',-2.00),(98,'刘一','2018-08-14 10:28:58','2018-08-14 10:29:04',-2.00),(99,'刘一','2018-08-14 15:37:08',NULL,NULL),(100,'张三','2018-08-14 15:38:51','2018-08-14 15:39:12',-2.00),(101,'刘一','2018-08-16 21:39:42','2018-08-16 21:39:45',-2.00),(102,'刘一','2018-08-16 21:40:20','2018-08-16 21:40:25',-2.00),(103,'刘一','2018-08-16 21:40:30','2018-08-16 21:40:37',-2.00),(104,'刘一','2018-08-16 21:40:39','2018-08-16 21:40:46',-2.00),(105,'刘一','2018-08-16 21:45:21','2018-08-16 22:19:57',-2.00),(106,'刘一','2018-08-16 22:20:00','2018-08-16 22:20:03',-2.00),(107,'刘一','2018-08-16 22:20:23','2018-08-16 22:20:24',-2.00),(108,'刘一','2018-08-16 22:27:20','2018-08-16 22:27:22',-2.00),(109,'jack','2018-08-17 20:22:46','2018-08-17 20:23:01',-2.00),(110,'刘一','2018-08-18 09:17:44','2018-08-18 09:17:48',-2.00),(111,'刘一','2018-08-18 11:05:55','2018-08-18 11:05:57',-2.00),(112,'刘一','2018-08-27 13:23:03','2018-08-27 13:23:15',-2.00),(113,'刘一','2018-08-27 16:57:35','2018-08-27 16:57:41',-2.00),(114,'刘一','2018-08-30 08:58:05','2018-08-30 08:59:25',-2.00),(115,'刘一','2018-09-04 11:00:26','2018-09-05 15:44:58',-2.00),(116,'刘一','2018-09-05 15:45:02','2018-09-06 15:14:50',-2.00),(117,'刘一','2018-09-09 10:45:00','2018-09-09 10:45:13',-2.00),(118,'刘一','2018-09-09 11:12:51',NULL,NULL),(119,'刘一','2018-09-13 10:43:24','2018-09-21 17:12:50',-2.00),(120,'刘一','2018-09-21 17:12:56','2018-09-21 17:13:03',-2.00),(121,'刘一','2018-11-22 09:13:09','2018-11-22 09:13:11',-2.00),(122,'刘一','2018-11-22 10:18:55',NULL,NULL),(123,'qwe','2018-12-11 23:36:10','2018-12-11 23:36:15',-2.00),(124,'刘一','2019-01-23 18:04:08','2019-01-23 18:04:12',-2.00),(125,'刘一','2019-01-23 18:04:21','2019-02-26 16:29:51',-2.00);
/*!40000 ALTER TABLE `ps_parking_log` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `ps_parking_place`
--

DROP TABLE IF EXISTS `ps_parking_place`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `ps_parking_place` (
  `park_id` varchar(10) NOT NULL,
  `park_name` varchar(50) DEFAULT NULL,
  `park_state` int(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ps_parking_place`
--

LOCK TABLES `ps_parking_place` WRITE;
/*!40000 ALTER TABLE `ps_parking_place` DISABLE KEYS */;
INSERT INTO `ps_parking_place` VALUES ('1111','A区1号',0),('2222','A区2号',0),('3333','A区3号',0),('5555','A区4号',0),('6666','A区5号',0),('8888','A区6号',0);
/*!40000 ALTER TABLE `ps_parking_place` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `ps_topup_log`
--

DROP TABLE IF EXISTS `ps_topup_log`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `ps_topup_log` (
  `tl_id` int(10) NOT NULL AUTO_INCREMENT,
  `user_name` varchar(100) NOT NULL,
  `tl_time` varchar(100) NOT NULL,
  `tl_money` double(50,2) NOT NULL,
  PRIMARY KEY (`tl_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=52 DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ps_topup_log`
--

LOCK TABLES `ps_topup_log` WRITE;
/*!40000 ALTER TABLE `ps_topup_log` DISABLE KEYS */;
INSERT INTO `ps_topup_log` VALUES (1,'刘一','2018-06-25 10:22:20\r\n',100.50),(2,'刘一','2018-07-25 10:22:20\r\n',100.50),(3,'陈二','2018-07-25 10:22:20\r\n',30.00),(4,'陈二','2018-07-25 10:22:20\r\n',50.00),(5,'张三','2018-07-25 10:28:01',200.00),(6,'张三','2018-07-25 10:28:01',50.00),(7,'李四','2018-07-25 10:29:45',100.00),(8,'李四','2018-07-25 10:29:45',600.00),(9,'李四','2018-07-25 10:30:37',5500.00),(10,'王五','2018-07-25 10:31:37',6000.00),(11,'赵六','2018-07-25 10:31:37',3000.00),(12,'赵六','2018-07-25 10:32:45',5500.00),(13,'刘一','2018-06-25 10:22:20\r\n',100.50),(14,'刘一','2018-07-25 10:22:20\r\n',100.50),(15,'陈二','2018-07-25 10:22:20\r\n',30.00),(16,'陈二','2018-07-25 10:22:20\r\n',50.00),(17,'张三','2018-07-25 10:28:01',200.00),(18,'张三','2018-07-25 10:28:01',50.00),(19,'李四','2018-07-25 10:29:45',100.00),(20,'李四','2018-07-25 10:29:45',600.00),(21,'李四','2018-07-25 10:30:37',5500.00),(22,'王五','2018-07-25 10:31:37',6000.00),(23,'赵六','2018-07-25 10:31:37',3000.00),(24,'赵六','2018-07-25 10:32:45',5500.00),(25,'120','2018-7-27 10:25;30',100.00),(31,'刘一','2018-08-11 21:58:40.631',120.00),(32,'刘一','2018-08-11 22:01:13.526',150.00),(33,'刘一','2018-08-11 22:04:27.942',100.00),(34,'root','2018-08-13 15:13:46.57',10000000000000000000000000000.00),(35,'root','2018-08-13 15:14:08.633',10000000000000000000000000000000000.00),(36,'刘一','2018-08-15 11:54:33.671',10.00),(37,'tom','2018-08-16 13:45:31.373',100.00),(38,'tom','2018-08-16 14:27:24.918',1000.00),(39,'tom','2018-08-16 14:28:16.537',10.00),(40,'tom','2018-08-16 14:29:02.627',500.00),(41,'tom','2018-08-16 14:33:49.08',200.00),(42,'tom','2018-08-16 19:14:25.88',20.00),(43,'刘一','2018-08-16 19:49:20.196',20.00),(44,'刘一','2018-08-16 22:27:48.192',20.00),(45,'刘一','2018-08-18 11:06:06.434',20.00),(46,'刘一','2018-08-27 16:57:19.084',10.00),(47,'刘一','2018-09-06 11:21:27.207',20.00),(48,'刘一','2018-11-22 09:12:14.567',20.00),(49,'刘一','2019-01-23 18:03:37.281',500.00),(50,'刘一','2019-03-07 17:06:24.22',20.00),(51,'刘一','2019-03-07 19:22:27.78',200.00);
/*!40000 ALTER TABLE `ps_topup_log` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `ps_user`
--

DROP TABLE IF EXISTS `ps_user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `ps_user` (
  `user_id` int(10) NOT NULL AUTO_INCREMENT,
  `user_name` varchar(100) NOT NULL,
  `user_password` varchar(100) NOT NULL,
  `user_realname` varchar(100) NOT NULL,
  `user_gender` varchar(100) NOT NULL,
  `user_card` varchar(100) NOT NULL,
  `user_phone` varchar(50) NOT NULL,
  `user_balance` double(100,2) NOT NULL,
  `user_card_state` varchar(10) DEFAULT NULL,
  PRIMARY KEY (`user_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=42 DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ps_user`
--

LOCK TABLES `ps_user` WRITE;
/*!40000 ALTER TABLE `ps_user` DISABLE KEYS */;
INSERT INTO `ps_user` VALUES (1,'刘一','123456','刘一','男','苏EG08P9','15770875270',11112.00,'1'),(2,'陈二','123456','陈二','女','川AT0H69','15770875271',10.00,'0'),(3,'张三','123456','张三','男','粤CKC23','15770875273',42.00,'0'),(4,'李四','123456','李四','男','浙AB8888','15770875278',5000.00,'0'),(5,'王五','123456','王五','男','粤A2222','15770875279',5998.00,'0'),(6,'赵六','123456','赵六','男','沪F88888','15770875362',8000.00,'0'),(29,'小刘','123456','小刘','男','这','15632698547',0.00,'0'),(30,'小张','123456','小张','男','流量','15236548855',0.00,'0'),(31,'老刘','123456','老刘','男','赣110S120','15999999999',0.00,'0'),(32,'小贝贝','123456','小贝贝','男','陕111111','12345679898',0.00,'0'),(33,'username','123456','asdf','男','asdfasdf11213','12345698745',0.00,'0'),(34,'凉凉','123456','凉凉','男','亮123456','12365478998',0.00,'0'),(35,'tom','123456','康康','男','酒123456','12364978548',1820.00,'0'),(36,'gr','123456','张凯','女','980000','13247875256',-2.00,'0'),(37,'root','root12345','张三','男','123456','11111111111',10000010000000000000000000000000000.00,'0'),(38,'贝贝贝','123456','贝贝','男','沪S-jjsjs','15777777777',0.00,'0'),(39,'jack','123456','张三','男','京A-AMD77','15555555555',-2.00,'0'),(40,'张经理','123456','张三','男','京A-156235','16675576852',0.00,'0'),(41,'qwe','qweqwe','chen','男','京A-1231231231','13591145236',-2.00,'0');
/*!40000 ALTER TABLE `ps_user` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2019-03-26 13:04:57
